temp.html

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <a:Action s:mustUnderstand="1">Create</a:Action>
        <a:To s:mustUnderstand="1">https://mcpwgrxj4n94hv1pvdyqw0zwdxyq.soap.marketingcloudapis.com/Service.asmx</a:To>
        <fueloauth xmlns="http://exacttarget.com">eyJhbGciOiJIUzI1NiIsImtpZCI6IjQiLCJ2ZXIiOiIxIiwidHlwIjoiSldUIn0.eyJhY2Nlc3NfdG9rZW4iOiJYTmZVZ3RtMHZFanVxNlkwaXNPMzVjTUsiLCJjbGllbnRfaWQiOiIzc3AxejRxeDk3cnE0dXVjeHF0ZjBzMmYiLCJlaWQiOjUxMDAwNTIwMCwic3RhY2tfa2V5IjoiUzUwIiwicGxhdGZvcm1fdmVyc2lvbiI6MiwiY2xpZW50X3R5cGUiOiJTZXJ2ZXJUb1NlcnZlciIsInBpZCI6NTQ2fQ.0syAGAsSyLKUYUBjiJbh4KJuwpjZXiyKLsNhRawxuQQ.1phlO3kedAWU651gPD251MXO2fz7dgfZZOMmFjMLkz_6A_lWIzl-79oBXvtRIpw4sSpGTCrskV-QjNeW913RiFhdZTlDY7CLUOki-RcLh0FG7mUJxUYVDXGZxZdi5_h8L9Wj9L1j9E15uvtAypdHhAWWTwj4yMMRR1fHq</fueloauth>
    </s:Header>

    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
           <Objects xsi:type="DataFolder">
                <CustomerKey>email folder1</CustomerKey>
                <ParentFolder>
                    <ID>48517</ID>
                </ParentFolder>
                <Name>email folder1</Name>
                <Description>email folder1</Description>
                <ContentType>dataextension</ContentType>
                <IsActive>true</IsActive>
                <IsEditable>true</IsEditable>
                <AllowChildren>true</AllowChildren>
            </Objects>
        </CreateRequest>
    </s:Body>
</s:Envelope>



<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">

    <s:Header>
        <a:Action s:mustUnderstand="1">Create</a:Action>
        <a:To s:mustUnderstand="1">{uri}</a:To>
        <fueloauth>{access_token}</fueloauth>
    </s:Header>

    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
            <Objects xsi:type="DataFolder">
                <CustomerKey>RANDOM</CustomerKey>
                <ParentFolder>
                    <ID>48517</ID>
                </ParentFolder>
                <Name>{name}</Name>
                <Description>email folder1</Description>
                <ContentType>dataextension</ContentType>
                <IsActive>true</IsActive>
                <IsEditable>true</IsEditable>
                <AllowChildren>true</AllowChildren>
            </Objects>
        </CreateRequest>
    </s:Body>
</s:Envelope>